app/Controllers/Home.php

    public function index()
    {
        $blogs = new Abc();
        $data['title'] = "Welcome To Our Blog Site";
        $data['blogs'] = $blogs->orderBy('blog_id', 'desc')->findAll();
---
SELECT *
FROM `blogs`
ORDER BY `blog_id` DESC