app/Models/ContactModel.php

    public function saveData($data)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('contact_us');


        $res = $builder->insert($data);
---
INSERT INTO `contact_us` (`name`, `phone_number`, `email`, `message`) VALUES ('SIDDHARTH GOR', '8787878787', 'gorsiddharth@gmail.com', 'ssssssssssssss')